Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: In other words, you must be able to call `Perform<R>(args)` where `R` is the mock function's return type and `args` is its arguments in a tuple.
it_it: In altre parole, si deve essere in grado di chiamare `Perform<R>(args)` dove `R` è il tipo restituito dalla funzione mock e `args` sono i suoi argomenti in una tupla.

source: In particular, a matcher can never call a mock function, as that will affect the state of the mock object and gMock.
it_it: In particolare, un matcher non può mai chiamare una funzione mock, poiché ciò influenzerà lo stato dell'oggetto mock e di gMock.

source: In particular, death tests don't like having multiple threads in the parent process.
it_it: In particolare, ai death test non piace avere più thread nel processo principale.

source: In particular, if statement generates an ASSERT_* or EXPECT_* failure, it will not cause the death test to fail, as GoogleTest assertions don't abort the process.
it_it: In particolare, se l'istruzione genera un errore ASSERT_* o EXPECT_*, non farà fallire il death test, poiché le asserzioni di GoogleTest non interrompono il processo.

source: In particular, if `statement` generates an `ASSERT_*` or `EXPECT_*` failure, it will **not** cause the death test to fail, as GoogleTest assertions don't abort the process.
it_it: In particolare, se l'`istruzione` genera un errore `ASSERT_*` o `EXPECT_*`, **non** farà fallire il death test, poiché le asserzioni di GoogleTest non interrompono il processo.

source: In particular, if you release memory in a death test, your program will fail the heap check as the parent process will never see the memory reclaimed.
it_it: In particolare, se si rilascia memoria in un death test, il programma fallirà il controllo dell'heap poiché il processo principale non vedrà mai la memoria recuperata.

source: In particular, if you use mocking and the death test statement invokes some mock methods, the parent process will think the calls have never occurred.
it_it: In particolare, se si utilizza il mocking e l'enunciato del death test invoca alcuni metodi mock, il processo genitore penserà che le chiamate non siano mai avvenute.

source: In particular, it can reference global and/or local variables, and can be:
it_it: In particolare può fare riferimento a variabili globali e/o locali e può essere:

source: In particular, it does file and I/O operations.
it_it: In particolare, vengono eseguite operazioni su file e I/O.

source: In particular, it doesn't have to be a method of the test fixture class.
it_it: In particolare, non deve essere un metodo della classe fixture del test.

source: In particular, it parses the command line for the flags that GoogleTest recognizes.
it_it: In particolare, analizza la riga di comando per i flag riconosciuti da GoogleTest.

source: In particular, it prevents you from writing `Foo<sizeof(htonl(x))>()`, where `Foo` is a template that has an integral argument.
it_it: In particolare, impedisce di scrivere `Foo<sizeof(htonl(x))>()`, dove `Foo` è un template che ha un argomento intero.

source: In particular, nesting `NiceMock` and `StrictMock` (e.g. `NiceMock<StrictMock<MockFoo> >`) is **not** supported.
it_it: In particolare, la nidificazione di `NiceMock` e `StrictMock` (ad esempio `NiceMock<StrictMock<MockFoo> >`) **non** è supportata.

source: In particular, they should not contain underscores
it_it: In particolare, non devono contenere gli underscore

source: In particular, they [should not contain underscores](faq.md#why-should-test-suite-names-and-test-names-not-contain-underscore)
it_it: In particolare, [non devono contenere gli underscore](faq.md#why-should-test-suite-names-and-test-names-not-contain-underscore)

source: In particular, using it in GoogleTest comparison assertions (`EXPECT_EQ`, etc.) will generate an "undefined reference" linker error.
it_it: In particolare, utilizzarlo nelle asserzioni di confronto di GoogleTest (`EXPECT_EQ`, ecc.) genererà un errore del linker "undefined reference".

source: In particular, you cannot find the test suite name in `SetUpTestSuite()`, `TearDownTestSuite()` (where you know the test suite name implicitly), or functions called from them.
it_it: In particolare, non è possibile trovare il nome della test suite in `SetUpTestSuite()`, `TearDownTestSuite()` (dove si conosce implicitamente il nome della test suite) né nelle funzioni chiamate da essi.

source: In production, you will instantiate your template with ConcretePacketStream as the type argument.
it_it: In produzione, si creerà un'istanza del template con ConcretePacketStream come argomento del tipo.

source: In production, you will instantiate your template with `ConcretePacketStream` as the type argument.
it_it: In produzione, si creerà un'istanza del template con `ConcretePacketStream` come argomento del tipo.

source: In some cases (e.g. iterative test development & execution) it may be desirable stop test execution upon first failure (trading improved latency for completeness).
it_it: In alcuni casi (ad esempio sviluppo ed esecuzione iterativi di test) potrebbe essere auspicabile interrompere l'esecuzione del test al primo fallimento (scambiando la maggiore latenza con la completezza).

source: In test output, the instantiation name is added as a prefix to the test suite name TestSuiteName.
it_it: Nell'output del test, il nome dell'istanza viene aggiunto come prefisso al nome della test suite TestSuiteName.

source: In test output, the instantiation name is added as a prefix to the test suite name *`TestSuiteName`*.
it_it: Nell'output del test, il nome dell'istanza viene aggiunto come prefisso al nome della test suite *`TestSuiteName`*.

source: In tests, you can easily mock that interface to observe how your code is doing.
it_it: Nei test, si puoi facilmente creare il mock dell'interfaccia per osservare come sta andando il codice.

source: In tests, you will instantiate the same template with MockPacketStream.
it_it: Nei test, si istanzierà lo stesso template con MockPacketStream.

source: In tests, you will instantiate the same template with `MockPacketStream`.
it_it: Nei test, si istanzierà lo stesso template con `MockPacketStream`.

source: In the following code examples, we assume that we have defined a MockBuzzer object named mock_buzzer_:
it_it: Nei seguenti esempi di codice, assumiamo di aver definito un oggetto MockBuzzer chiamato mock_buzzer_:

source: In the public: section of the child class, write MOCK_METHOD();
it_it: Nella sezione public: della classe figlia, si scrive MOCK_METHOD();

source: In the Bar(IsDivisibleBy7()) example above, if method Bar() takes an int, arg_type will be int; if it takes an unsigned long, arg_type will be unsigned long; and so on.
it_it: Nell'esempio Bar(IsDivisibleBy7()) sopra, se il metodo Bar() accetta un int, arg_type sarà int; se richiede un unsigned long, arg_type sarà unsigned long; e così via.

source: In the `Bar(IsDivisibleBy7())` example above, if method `Bar()` takes an `int`, `arg_type` will be `int`; if it takes an `unsigned long`, `arg_type` will be `unsigned long`; and so on.
it_it: Nell'esempio `Bar(IsDivisibleBy7())` sopra, se il metodo `Bar()` accetta un `int`, `arg_type` sarà `int`; se richiede un `unsigned long`, `arg_type` sarà `unsigned long`; e così via.

source: In the `public:` section of the child class, write `MOCK_METHOD();`
it_it: Nella sezione `public:` della classe figlia, si scrive `MOCK_METHOD();`

source: In the above example, 5ab508a01f9eb089207ee87fd547d290da39d015 is the Git commit hash of the GoogleTest version to use; we recommend updating the hash often to point to the latest version.
it_it: Nell'esempio precedente, 5ab508a01f9eb089207ee87fd547d290da39d015 è l'hash del commit Git della versione di GoogleTest da utilizzare; consigliamo di aggiornare spesso l'hash in modo che punti alla versione più recente.

source: In the above example, 03597a01ee50ed33e9dfd640b249b4be3799d395 is the Git commit hash of the GoogleTest version to use; we recommend updating the hash often to point to the latest version.
it_it: Nell'esempio precedente, 03597a01ee50ed33e9dfd640b249b4be3799d395 è l'hash del commit Git della versione di GoogleTest da utilizzare; consigliamo di aggiornare spesso l'hash in modo che punti alla versione più recente.

source: In the above example, `03597a01ee50ed33e9dfd640b249b4be3799d395` is the Git commit hash of the GoogleTest version to use; we recommend updating the hash often to point to the latest version.
it_it: Nell'esempio precedente, `03597a01ee50ed33e9dfd640b249b4be3799d395` è l'hash del commit Git della versione di GoogleTest da utilizzare; consigliamo di aggiornare spesso l'hash in modo che punti alla versione più recente.

source: In the above example, `5ab508a01f9eb089207ee87fd547d290da39d015` is the Git commit hash of the GoogleTest version to use; we recommend updating the hash often to point to the latest version.
it_it: Nell'esempio precedente, `5ab508a01f9eb089207ee87fd547d290da39d015` è l'hash del commit Git della versione di GoogleTest da utilizzare; consigliamo di aggiornare spesso l'hash in modo che punti alla versione più recente.

source: In the above example, the final assertion fails and the predicate-formatter produces the following failure message:
it_it: Nell'esempio precedente, l'asserzione finale fallisce e il predicate-formatter produce il seguente messaggio di errore:

source: In the above example, the first assertion succeeds, and the second fails with the following message:
it_it: Nell'esempio precedente, la prima asserzione ha esito positivo e la seconda fallisce con il seguente messaggio:

source: In the above example, the first two calls to my_mock.SetNumber(7) match expectation 2, which then becomes inactive and no longer matches any calls.
it_it: Nell'esempio precedente, le prime due chiamate a my_mock.SetNumber(7) corrispondono [match] alla expectation 2, che quindi diventa inattiva e non corrisponde [match] più ad alcuna chiamata.

source: In the above example, the first two calls to `my_mock.SetNumber(7)` match expectation 2, which then becomes inactive and no longer matches any calls.
it_it: Nell'esempio precedente, le prime due chiamate a `my_mock.SetNumber(7)` corrispondono [match] alla expectation 2, che quindi diventa inattiva e non corrisponde [match] più ad alcuna chiamata.

source: In the above example, we have two tests, HandlesZeroInput and HandlesPositiveInput, that belong to the same test suite FactorialTest.
it_it: Nell'esempio precedente, abbiamo due test, HandlesZeroInput e HandlesPositiveInput, che appartengono alla test suite FactorialTest.

source: In the above example, we have two tests, `HandlesZeroInput` and `HandlesPositiveInput`, that belong to the same test suite `FactorialTest`.
it_it: Nell'esempio precedente, abbiamo due test, `HandlesZeroInput` e `HandlesPositiveInput`, che appartengono alla test suite `FactorialTest`.

source: In the above examples, 100 and 50 are also matchers; implicitly, they are the same as Eq(100) and Eq(50), which specify that the argument must be equal (using operator==) to the matcher argument.
it_it: Negli esempi precedenti, anche 100 e 50 sono matcher; implicitamente, sono lo stesso di Eq(100) e Eq(50), che specificano che l'argomento deve essere uguale (usando operator==) all'argomento matcher.

source: In the above examples, `100` and `50` are also matchers; implicitly, they are the same as `Eq(100)` and `Eq(50)`, which specify that the argument must be equal (using `operator==`) to the matcher argument.
it_it: Negli esempi precedenti, anche `100` e `50` sono matcher; implicitamente, sono lo stesso di `Eq(100)` e `Eq(50)`, che specificano che l'argomento deve essere uguale (usando `operator==`) all'argomento matcher.

source: In the above, we define and instantiate FooTest in the same source file.
it_it: Abbiamo definito e istanziato FooTest nello stesso file sorgente.

source: In the above, we define and instantiate `FooTest` in the *same* source file.
it_it: Abbiamo definito e istanziato `FooTest` nello *stesso* file sorgente.

source: In the body of a constructor (or destructor), it's not possible to use the ASSERT_xx macros.
it_it: Nel corpo di un costruttore (o di un distruttore), non è possibile utilizzare le macro ASSERT_xx.

source: In the body of a constructor (or destructor), it's not possible to use the `ASSERT_xx` macros.
it_it: Nel corpo di un costruttore (o di un distruttore), non è possibile utilizzare le macro `ASSERT_xx`.

source: In the end, this boils down to good concurrent programming.
it_it: Alla fine, questo si riduce a una buona programmazione concorrente.

source: In the example above, action_n could be Return(true), or a lambda that returns a bool, but not SaveArg, which returns void.
it_it: Nell'esempio sopra, action_n potrebbe essere Return(true) o una lambda che restituisce un bool, ma non SaveArg, che restituisce void.

source: In the example above, `action_n` could be `Return(true)`, or a lambda that returns a `bool`, but not `SaveArg`, which returns `void`.
it_it: Nell'esempio sopra, `action_n` potrebbe essere `Return(true)` o una lambda che restituisce un `bool`, ma non `SaveArg`, che restituisce `void`.

source: In the example above, we set our normal gMock expectations, but then add an additional action to notify the Notification object.
it_it: Nell'esempio sopra, impostiamo le nostre normali expectation gMock, ma poi aggiungiamo un'azione aggiuntiva per notificare l'oggetto Notification.

source: In the example above, we set our normal gMock expectations, but then add an additional action to notify the `Notification` object.
it_it: Nell'esempio sopra, impostiamo le nostre normali expectation gMock, ma poi aggiungiamo un'azione aggiuntiva per notificare l'oggetto `Notification`.

source: In the following code examples, we assume that we have defined a `MockBuzzer` object named `mock_buzzer_`:
it_it: Nei seguenti esempi di codice, assumiamo di aver definito un oggetto `MockBuzzer` chiamato `mock_buzzer_`:

source: In the following, by "callable" we mean a free function, std::function, functor, or lambda.
it_it: Di seguito, con "callable" (chiamabile) intendiamo una funzione libera, std::function, un funtore o una lambda.

source: In the following, by "callable" we mean a free function, `std::function`, functor, or lambda.
it_it: Di seguito, con "callable" (chiamabile) intendiamo una funzione libera, `std::function`, un funtore o una lambda.

source: In the matcher definition body, you can write foo_type to reference the type of a parameter named foo.
it_it: Nel corpo della definizione del matcher, si può scrivere foo_type per fare riferimento al tipo di un parametro chiamato foo.

source: In the matcher definition body, you can write `foo_type` to reference the type of a parameter named `foo`.
it_it: Nel corpo della definizione del matcher, si può scrivere `foo_type` per fare riferimento al tipo di un parametro chiamato `foo`.

source: In the same test fixture class, define a public member function static void SetUpTestSuite() (remember not to spell it as SetupTestSuite with a small u!) to set up the shared resources and a static void TearDownTestSuite() function to tear them down.
it_it: Nella stessa classe fixture, si definisce una funzione membro pubblica static void SetUpTestSuite() (ricordarsi di non scriverlo come SetupTestSuite con una u minuscola!) per impostare le risorse condivise e una funzione static void TearDownTestSuite() per eliminarle.

source: In the same test fixture class, define a public member function `static void SetUpTestSuite()` (remember not to spell it as **`SetupTestSuite`** with a small `u`!) to set up the shared resources and a `static void TearDownTestSuite()` function to tear them down.
it_it: Nella stessa classe fixture, si definisce una funzione membro pubblica `static void SetUpTestSuite()` (ricordarsi di non scriverlo come **`SetupTestSuite`** con una `u` minuscola!) per impostare le risorse condivise e una funzione `static void TearDownTestSuite()` per eliminarle.

source: In the special case where the type list contains only one type, you can write that type directly without ::testing::Types<...>, like this:
it_it: Nel caso speciale in cui l'elenco dei tipi contiene solo un tipo, lo si può scrivere direttamente senza ::testing::Types<...>, in questo modo:

source: In the special case where the type list contains only one type, you can write that type directly without `::testing::Types<...>`, like this:
it_it: Nel caso speciale in cui l'elenco dei tipi contiene solo un tipo, lo si può scrivere direttamente senza `::testing::Types<...>`, in questo modo:

source: In the third time, gMock will see that the arguments match expectation #2 (remember that we always pick the last matching expectation).
it_it: Nella terza volta, gMock vedrà che gli argomenti corrispondono alla expectation #2 (ricordate che scegliamo sempre l'ultima expectation corrispondente).

source: In this case, the test should reflect our real intent, instead of being overly constraining.
it_it: In questo caso, il test dovrebbe riflettere il nostro reale intento, invece di essere eccessivamente vincolante.

source: In this case, TearDown() is not needed since we don't have to clean up after each test, other than what's already done by the destructor.
it_it: In questo caso, TearDown() non è necessario poiché non dobbiamo ripulire dopo ogni test, oltre a ciò che è già stato fatto dal distruttore.

source: In this case, `TearDown()` is not needed since we don't have to clean up after each test, other than what's already done by the destructor.
it_it: In questo caso, `TearDown()` non è necessario poiché non dobbiamo ripulire dopo ogni test, oltre a ciò che è già stato fatto dal distruttore.

source: In this case, all active trace points will be included in the failure messages, in reverse order they are encountered.
it_it: In questo caso, tutti i trace point attivi verranno inclusi nei messaggi di errore, nell'ordine inverso in cui vengono incontrati.

source: In this case, if the method is ever called, gMock will perform its default action to allow the test program to continue.
it_it: In questo caso, se il metodo viene chiamato, gMock eseguirà la sua azione di default per consentire al programma di test di continuare.

source: In this case, instead of sharing a common base class with the real class, your mock class will be unrelated to the real class, but contain methods with the same signatures.
it_it: In questo caso, invece di condividere una classe base comune con la classe reale, la classe mock sarà non correlata alla classe reale, ma conterrà metodi con le stesse firme.

source: In this case, instead of sharing a common base class with the real class, your mock class will be *unrelated* to the real class, but contain methods with the same signatures.
it_it: In questo caso, invece di condividere una classe base comune con la classe reale, la classe mock sarà *non correlata* alla classe reale, ma conterrà metodi con le stesse firme.

source: In this case, you can try to minimize the chance of conflicts by either moving as many activities as possible inside EXPECT_DEATH() (in the extreme case, you want to move everything inside), or leaving as few things as possible in it.
it_it: In questo caso, si può provare a ridurre al minimo la possibilità di conflitti spostando quante più attività possibili all'interno di EXPECT_DEATH() (nel caso estremo, si può spostare tutto all'interno), o lasciandone poche cose.

source: In this case, you can try to minimize the chance of conflicts by either moving as many activities as possible inside `EXPECT_DEATH()` (in the extreme case, you want to move everything inside), or leaving as few things as possible in it.
it_it: In questo caso, si può provare a ridurre al minimo la possibilità di conflitti spostando quante più attività possibili all'interno di `EXPECT_DEATH()` (nel caso estremo, si può spostare tutto all'interno), o lasciandone poche cose.

source: In this case, you don't have to choose a unique message for SCOPED_TRACE.
it_it: In questo caso, non è necessario scegliere un messaggio univoco per SCOPED_TRACE.

source: In this case, you don't have to choose a unique message for `SCOPED_TRACE`.
it_it: In questo caso, non è necessario scegliere un messaggio univoco per `SCOPED_TRACE`.

source: In this example, we expect a call to foo.DoThis(5), followed by two calls to bar.DoThat() where the argument can be anything, which are in turn followed by a call to foo.DoThis(6).
it_it: In questo esempio, ci aspettiamo una chiamata a foo.DoThis(5), seguita da due chiamate a bar.DoThat() dove l'argomento può essere qualsiasi cosa, che sono a turno seguito da una chiamata a foo.DoThis(6).

source: In this example, we expect a call to `foo.DoThis(5)`, followed by two calls to `bar.DoThat()` where the argument can be anything, which are in turn followed by a call to `foo.DoThis(6)`.
it_it: In questo esempio, ci aspettiamo una chiamata a `foo.DoThis(5)`, seguita da due chiamate a `bar.DoThat()` dove l'argomento può essere qualsiasi cosa, che sono a turno seguite da una chiamata a `foo.DoThis(6)`.

source: In this example, we test that Foo() calls the three expected functions in the order as written.
it_it: In questo esempio, testiamo che Foo() chiami le tre funzioni expected nell'ordine in cui sono scritte.

source: In this example, we test that `Foo()` calls the three expected functions in the order as written.
it_it: In questo esempio, testiamo che `Foo()` chiami le tre funzioni expected nell'ordine in cui sono scritte.

source: In this example, when mutator.Mutate() is called, we will assign 5 to the int variable pointed to by argument #1 (0-based).
it_it: In questo esempio, quando viene chiamato mutator.Mutate(), assegneremo 5 alla variabile int puntata dall'argomento #1 (in base 0).

source: In this example, when `mutator.Mutate()` is called, we will assign 5 to the `int` variable pointed to by argument #1 (0-based).
it_it: In questo esempio, quando viene chiamato `mutator.Mutate()`, assegneremo 5 alla variabile `int` puntata dall'argomento #1 (in base 0).

source: In this function, along with any valid C++ statements you want to include, use the various GoogleTest assertions to check values.
it_it: In questa funzione, insieme a qualsiasi istruzione C++ valida che si voglia includere, si utilizzano le varie asserzioni di GoogleTest per verificare i valori.

source: In this suite, their SetUp() will be called in the order they are registered, and their TearDown() will be called in the reverse order.
it_it: In questa suite, il loro SetUp() verrà chiamato nell'ordine in cui sono registrati, e il loro TearDown() verrà chiamato nell'ordine inverso.

source: In this suite, their `SetUp()` will be called in the order they are registered, and their `TearDown()` will be called in the reverse order.
it_it: In questa suite, il loro `SetUp()` verrà chiamato nell'ordine in cui sono registrati, e il loro `TearDown()` verrà chiamato nell'ordine inverso.

source: In your test code, you can call RecordProperty("key", value) to log additional information, where value can be either a string or an int.
it_it: Nel codice del test, si può chiamare RecordProperty("key", value) per loggare informazioni aggiuntive, dove value può essere una stringa o un int.

source: In your test code, you can call `RecordProperty("key", value)` to log additional information, where `value` can be either a string or an `int`.
it_it: Nel codice del test, si può chiamare `RecordProperty("key", value)` per loggare informazioni aggiuntive, dove `value` può essere una stringa o un `int`.
